tool.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2022-01-02 Sun 22:25 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Linux - Command Line Tools</title>
<meta name="author" content="shaka" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="default.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Linux - Command Line Tools</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org97861df">Starship</a></li>
<li><a href="#orge3a141f">File finder</a>
<ul>
<li><a href="#orgfb42480">fd</a></li>
<li><a href="#org1bf5fb1">fzf</a></li>
</ul>
</li>
<li><a href="#orgf92ac28">Ripgrep</a></li>
<li><a href="#orgcc21837">System monitor</a>
<ul>
<li><a href="#org7ed701c">Htop</a></li>
<li><a href="#org0ac3340">Glance</a></li>
</ul>
</li>
<li><a href="#orge572392">Ncdu</a></li>
<li><a href="#org4e90602">Diff-so-fancy</a></li>
<li><a href="#orgbea2449">Exa</a></li>
<li><a href="#orgeb3c891">Bat</a></li>
<li><a href="#orgab79857">Tldr</a></li>
</ul>
</div>
</div>
<p>
Targetting for more features and conveniences, some extremely excellent command line tools are listed in this document, which is encouraged to use.
</p>

<div id="outline-container-org97861df" class="outline-2">
<h2 id="org97861df">Starship</h2>
<div class="outline-text-2" id="text-org97861df">
<p>
<a href="https://starship.rs">Starship</a> can provide an exciting prompt to a variety of shells, e.g., bash, csh/tcsh, zsh, etc.
</p>
<ul class="org-ul">
<li>Installation (e.g., for Arch Linux)</li>
</ul>
<div class="org-src-container">
<pre class="src src-sh">pacman -S starship
</pre>
</div>
<ul class="org-ul">
<li>Configuration in <code>~/.bashrc</code> (e.g., for bash)</li>
</ul>
<div class="org-src-container">
<pre class="src src-sh">eval "$(starship init bash)"
</pre>
</div>
</div>
</div>
<div id="outline-container-orge3a141f" class="outline-2">
<h2 id="orge3a141f">File finder</h2>
<div class="outline-text-2" id="text-orge3a141f">
</div>
<div id="outline-container-orgfb42480" class="outline-3">
<h3 id="orgfb42480">fd</h3>
<div class="outline-text-3" id="text-orgfb42480">
<p>
<a href="https://github.com/sharkdp/fd">Fd</a> is a replacement for classic <code>find</code>, which can be easily installed by
</p>
<div class="org-src-container">
<pre class="src src-sh">pacman -S fd
</pre>
</div>
</div>
</div>
<div id="outline-container-org1bf5fb1" class="outline-3">
<h3 id="org1bf5fb1">fzf</h3>
<div class="outline-text-3" id="text-org1bf5fb1">
<p>
<a href="https://github.com/jethrokuan/fzf">Fzf</a> stands for <i>fuzzy finder</i>, which can be easily installed by
</p>
<div class="org-src-container">
<pre class="src src-sh">pacman -S fzf
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgf92ac28" class="outline-2">
<h2 id="orgf92ac28">Ripgrep</h2>
<div class="outline-text-2" id="text-orgf92ac28">
<p>
<a href="https://github.com/BurntSushi/ripgrep">Ripgrep</a> is a replacement for classic <code>grep</code>, which can be easily installed by
</p>
<div class="org-src-container">
<pre class="src src-sh">pacman -S ripgrep
</pre>
</div>
</div>
</div>
<div id="outline-container-orgcc21837" class="outline-2">
<h2 id="orgcc21837">System monitor</h2>
<div class="outline-text-2" id="text-orgcc21837">
</div>
<div id="outline-container-org7ed701c" class="outline-3">
<h3 id="org7ed701c">Htop</h3>
<div class="outline-text-3" id="text-org7ed701c">
<p>
<a href="https://htop.dev">Htop</a> is an interactive provess viewer, envisaged as a replacement of classic <code>top</code>, which can be installed by
</p>
<div class="org-src-container">
<pre class="src src-sh">pacman -S htop
</pre>
</div>
</div>
</div>
<div id="outline-container-org0ac3340" class="outline-3">
<h3 id="org0ac3340">Glance</h3>
<div class="outline-text-3" id="text-org0ac3340">
<p>
<a href="https://nicolargo.github.io/glances">Glances</a> is a system monitor developped in Python, which can be installed by
</p>
<div class="org-src-container">
<pre class="src src-sh">pacman -S glances
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orge572392" class="outline-2">
<h2 id="orge572392">Ncdu</h2>
<div class="outline-text-2" id="text-orge572392">
<p>
<a href="https://dev.yorhel.nl/ncdu">Ncdu</a>, ncurses based disk usage, is a disk usage analyzer, and very useful to clean and release storage. It can be directly installed by
</p>
<div class="org-src-container">
<pre class="src src-sh">pacman -S ncdu
</pre>
</div>
</div>
</div>
<div id="outline-container-org4e90602" class="outline-2">
<h2 id="org4e90602">Diff-so-fancy</h2>
<div class="outline-text-2" id="text-org4e90602">
<p>
<a href="https://github.com/so-fancy/diff-so-fancy">Diff-so-fancy</a> is a replacement of <code>diff</code>, with more colors and highlights, which can be installed by
</p>
<div class="org-src-container">
<pre class="src src-sh">pacman -S diff-so-fancy
</pre>
</div>
<p>
It can be integrated with git, by running following commands.
</p>
<div class="org-src-container">
<pre class="src src-sh">git config --global core.pager "diff-so-fancy | less --tabs=4 -RFX"
git config --global interactive.diffFilter "diff-so-fancy --patch"
</pre>
</div>
</div>
</div>
<div id="outline-container-orgbea2449" class="outline-2">
<h2 id="orgbea2449">Exa</h2>
<div class="outline-text-2" id="text-orgbea2449">
<p>
<a href="https://the.exa.website">Exa</a> is a <code>ls</code> replacement. It can be installed by
</p>
<div class="org-src-container">
<pre class="src src-sh">pacman -S exa
</pre>
</div>
</div>
</div>
<div id="outline-container-orgeb3c891" class="outline-2">
<h2 id="orgeb3c891">Bat</h2>
<div class="outline-text-2" id="text-orgeb3c891">
<p>
<a href="https://github.com/sharkdp/bat">Bat</a> is a replacement of <code>cat</code>, with more colorful syntax highlighting, which can be installed by
</p>
<div class="org-src-container">
<pre class="src src-sh">pacman -S bat
</pre>
</div>
</div>
</div>
<div id="outline-container-orgab79857" class="outline-2">
<h2 id="orgab79857">Tldr</h2>
<div class="outline-text-2" id="text-orgab79857">
<p>
<a href="https://tldr.sh">Tldr</a> is a simplified manual tool, aiming to replace <code>man</code>.
</p>
<ul class="org-ul">
<li><p>
Installation
</p>
<div class="org-src-container">
<pre class="src src-sh">pacman -S tldr
</pre>
</div></li>
<li><p>
Configuration
</p>
<div class="org-src-container">
<pre class="src src-sh">tldr -u
</pre>
</div></li>
</ul>
</div>
</div>
</div>
</body>
</html>
